# -*- coding: utf-8 -*-

import re
from collections import Counter

import jieba
#import jieba.analyse


raw_text = u"""
2015年已经到来。面对厦门房价的持续坚挺，购房者对于2015年的置业计划有何想法？在关于“2015年厦门购房需求”问卷调查结果显示，4成受访者看涨今年厦门房价，15000元/平方米以下的单价成为受访者最能接受的房价区间。

调查数据显示，在购房用途中，高达62%的受访者选择首次置业需求，二次改善置业占比约为29%，基于投资目的的仅占9%。可见，首次置业在购房大军中依旧占据主流地位。从年龄层面上看，受访者大多偏年轻化，20-30岁人数占比约为51%。该类群体为适婚年龄，购房需求较为迫切。而从月收入水平来看，中等收入的工薪阶层仍是绝对的购房主力。数据显示，3001-6000元/月的普通工薪阶层约占总数的28%，月收入6001-10000元/月的收入人群约占30%。

在户型选择上，总价较低的中小户型在符合刚需置业购买力的同时，还保证一定的居住舒适度，成为受访者心目中的首选。其中，选择70平方米以下的受访者约占12%，选择70-90平方米的受访者约占46%。此外，首置改善型刚需客户的需求也不容小觑，选择120-144平方米首改产品的受访者约占20%。可以预见的是，两三房户型仍是后市置业热点，改善型需求也将得到进一步的释放。在价格上，近七成受访者倾向于15000元/平方米以下的单价，成为最能接受的房价区间。

而在购买区域的问题中，结果显示，青睐思明区和湖里区两个区域的比例仍然不低，共计约25%。岛外四区占比约为75%。其中，受新城建设、区域配套、地铁开工等利好消息的刺激，集美区依旧突出，成为购房者置业岛外的首选。来自市场的成交数据也很好地证明了这点。据相关数据显示，2014年各区成交量中，集美区以132.28万平方米的销售面积遥遥领先其他各区，市场占有率高达42.34%。

在去年全国楼市哀声一片的情况下，厦门房价却一如既往地保持坚挺。据悉，厦门房价从2012年6月起一直到2014年9月，创下连涨28个月不跌的纪录。此外，去年全年厦门住宅均价累计上涨幅度高达12.27%，远高于上涨城市的平均水平。那么，对于2015年的房价走势，购房者又是作何考虑呢？数据显示， 约35%受访者认为厦门房价将保持稳定，小幅上涨及小幅下跌的比重分别约为40%、16%，少数人认为房价会发生大幅变化。

房价的高低也直接影响了购房者的出手意愿。在是否考虑买房的因素中，68%的受访者认为房价走势将决定是否出手。“房价高位运行是阻碍买房的主因，想买房心有余而力不足。”王先生告诉记者，一套房子动辄150万元以上，首付款都很难凑够，对普通刚需来说是一个很大负担。读者苏女士在来信中也表达了类似的想法。她表示，厦门房价高得难以接受，如果能降一点就好了，毕竟“钱袋子”是迈不过去的一道坎。此外，随着去年楼市限购限贷松绑、央行降息等一系列政策的密集出台，21%的受访者则将政策走向作为买房的考量因素。

虽说房价居高不下让许多受访者观望，但是打算今年尽快出手的受访者也不少。“最近去售楼处咨询发现年前的优惠减少了不少，按照这趋势，开发商很有可能涨价，再等估计就更买不起。”黄小姐告诉记者，厦门气候宜居、房源供应不足又深受异地购房者的青睐，房价下跌的可能性非常小。加上今年是落户厦门的最后机会，为了赶上落户的“末班车”，还是尽早稳妥。
"""

# jieba.analyse.set_stop_words("stop_words.txt")
#
# seg_res = jieba.cut(raw_text)  # 默认是精确模式
#
# seg_list = list(seg_res)
#
# print(seg_list)
#
# seg_freq_counter = Counter(seg_list)
#
#
# print(seg_freq_counter)

accepted_chars = re.compile(ur"[\u4E00-\u9FA5]+")
words = jieba.tokenize(raw_text)


seg_list = []
for (w, start_pos, stop_pos) in words:
    if not accepted_chars.match(w) and len(w) <= 1:
        continue

    # @todo 可以使用 isdigit 判断是否为数字

    seg_list.append(w)

seg_freq_counter = Counter(seg_list)
print(seg_freq_counter)